# დავალება - 1

# შედარების ოპერატორები (Comprasion operators)

# ==   უდრის  თუ არა            5 == 5   → True
# !=   არ უდრის          5 != 3   → True
# >    მეტია              7 > 3    → True
# <    ნაკლებია           2 < 5    → True
# >=   მეტია ან ტოლია     5 >= 5   → True
# <=   ნაკლებია ან ტოლია  3 <= 4   → True  


# ლოგიკური ოპერატორები (Logical  operators)

 # and
# ორივე პირობა უნდა იყოს True, რომ შედეგიც True გამოვიდეს
# მაგ: (5 > 3) and (10 > 2) → True 

 #or 
# ერთი პირობა მაინც რომ იყოს True , შედეგი იქნება  True
# მაგ:(5 > 10) or (3 < 7) → True

#not
# not აბრუნებს პირობის საპირისპიროს.




# მაგ: not(5 > 3) → False

# დავალება - 2























  