
# დავალება-2


name = input("შეიყვანეთ თქვენი სახელი: ")
surname = input("შეიყვანეთ თქვენი გვარი: ")# დავალება-1

# რა არის Input and Output ?

# Input and Output პროგრამირებაში არის მონაცემების მიღება და გადაცემა.
#  შეიტანეთ ინფორმაცია, რომელიც შედის პროგრამაში, და გამომავალი ინფორმაცია, რომელიც პროგრამიდან გამოდის.

 # Input & Output მოწყობილობები:

# შეყვანის მოწყობილობები:

# კლავიატურა: მომხმარებლის ტექსტის და ბრძანებების შეყვანისთვის.
 # მაუსი: მომხმარებლის ეკრანზე ობიექტების არჩევანი და მანიპულაციისთვის.
 #  სკანერი: ფიზიკური დოკუმენტების ციფრულ ფორმატში გადაყვანისთვის.
 # მიკროფონი: აუდიო მონაცემების ჩაწერისთვის.
 # კამერა: ვიზუალური მონაცემების (ფოტოები, ვიდეოები) ჩაწერისთვის.

#გამომავალი მოწყობილობები:

 # ეკრანი: ვიზუალური გამოსახვისთვის.
 # პრინტერი: ციფრული მანქანა ფიზიკურ ფორმატში (დოკუმენტების) გადაყვანისთვის.
 # სპიკერები: აუდიო გამოსახვისთვის.
 # პროექტორი: ვიზუალური კომპიუტერული დიდი ეკრანზე გამოსახვისთვის.
 # ედფონები: პირადი აუდიო გამოცდილებისთვის.


# მოვიყვანოთ 5 მაგალითი Input and Output-ზე

# 1.
name = input("შეიყვანეთ თქვენი სახელი: ")
print("გამარჯობა, " + name + "!")

# 2.
age = input("შეიყვანეთ თქვენი ასაკი: ")
print("თქვენი ასაკი არის " + age + " წლის.")
   

# 3.
favorite_color = input("რა არის თქვენი საყვარელი ფერი? ")
print("თქვენი საყვარელი ფერი არის: " + favorite_color)


# 4.
hobby = input("რა არის თქვენი ჰობი? ")
print("თქვენი ჰობი არის: " + hobby)


# 5.
fav_movie = input("რა არის თქვენი საყვარელი ფილმი? ")
print("თქვენი საყვარელი ფილმი არის: " + fav_movie)
age = input("შეიყვანეთ თქვენი ასაკი: ")
address = input("შეიყვანეთ თქვენი მისამართი: ")
hobby = input("შეიყვანეთ თქვენი ჰობი: ")
fav_movie = input("შეიყვანეთ თქვენი საყვარელი ფილმი: ")

print("მე ვარ " + name + " " + surname + ", ჩემი ასაკია " + str(age) + ", ვცხოვრობ " + address + "-ში. მომწონს " + hobby + " და ჩემი საყვარელი ფილმი არის " + fav_movie + ".")



# დავალება 3.

number1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
number2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
number3 = float(input("შეიყვანეთ მესამე რიცხვი: "))
number4 = float(input("შეიყვანეთ მეოთხე რიცხვი: "))
number5 = float(input("შეიყვანეთ მეხუთე რიცხვი: "))

average = (number1 + number2 + number3 + number4 + number5) / 5

print("თქვენ მიერ შეყვანილი რიცხვების საშუალო არითმეტიკულია:", average)


# დავალება 4.

num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))

print("მიმატება:", num1 + num2)
print("გამოკლება:", num1 - num2)
print("გამრავლება:", num1 * num2)
print("გაყოფა:", num1 / num2)
print("მთელი გაყოფა:", num1 // num2)