# incredible in your face - 30  შეცდომა 

# 1
print "Hello"
#  ბრჭყალები არის, მაგრამ ფრჩხილები არა
# print("Hello")


# 2
print("Banana)
#  ერთი ბრჭყალი აკლია
#  print("Banana")

# 3
print(Apple)
#  Apple ბრჭყალებში უნდა იყოს, თორემ ცვლადია
#  print("Apple")

# 4
print("Age" + 10)
#  ტექსტს და რიცხვს ვერ ვაერთიანებთ
#  print("Age" + str(10))

# 5
print(9 + )
#  რაღაც აკლია – მეორე რიცხვი
#  print(9 + 1)

# 6
print(4 *)
#  არ ვიცით რასთან გაამრავლოს
#  print(4 * 3)

# 7
print("cat" * 3)
#  ტექსტის გამრავლება ტექსტზე არ შეიძლება
#  print("cat" * 3)

# 8 
print(10 +)
#  აკლია რიცხვი რომ გამოთვალოს 
#  print(10 + 5)


#9
print("7 - 4")
#  ეს ტექსტია, არა მოქმედება
#  print(7 - 4)

# 10
print('Water")
#  სხვადასხვა ბრჭყალებია
#  print("Water") ან print('Water')


#11
1st_name = "Snake"
# first_name = "Snake"
# ცვლადის სახელი არ შეიძლება იწყებოდეს რიცხვით


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


# შევქმნათ str  და int  ტიპის ცვლადები

name = "Snake"  
age = 25   

# დავბეჭდოთ წინადადება, სადაც ორივე ცვლადი გამოიყენება

print("ჩემი სახელია " + name + " და მე ვარ " + str(age) + " წლის.")

გამოიტანს ასე :

ჩემი Snake  და მე ვარ 25 წლის.

