

# დავალება - 3.
# შევქმნათ str  და int  ტიპის ცვლადები

name = "Snake"  
age = 999   

# დავბეჭდოთ წინადადება, სადაც ორივე ცვლადი გამოიყენება

print("ჩემი სახელია " + name + " და მე ვარ " + str(age) + " წლის.")

# გამოიტანს ასე :

 # ჩემი სახელია Snake  და მე ვარ 999 წლის.



# დავლება - 4.
# შევქმნათ მართკუთხედის ფართობი სიგრძე და სიგანე და დავბეჭდოთ
 

length=18.5
width=9.5
area=length*width

print(area)




# დავლება - 5
# ნივთის სახელისა და ფასის დაბეჭდვა

# str-ინგ ტიპის ცვლადი-ნივთის სახელი
Item="Telephone"

# float ტიპის ცვლადი — ფასი ლარებში
 
Price=2000.78 

print(Item + "ღირს" + str(Price) + "ლარი")



# დავლება - 6.
# ორი int ტიპის ცვლადი მათი დაბეჭდვა და ჯამი.

number1 = 15
number2 = 7
Total=number1+number2

print("ჯამი:"+ str(Total))


# დავალება - 7.

 # ორი int ტიპის ცვლადი
num1 = 20
num2 = 7
result = num1 / num2  

print("გაყოფის შედეგი:", result)

