 # 1. მონაცემების შენახვა და მათი ჩვენება

# ჩემი სახელი , ასაკი , სიმაღლე , წონა

name = "Snake"
age = 25
height = 180 
weight = 75  

print(name)
print(age)
print(height)
print(weight)

# 2. მონაცემთა ტიპები და მაგალითები

# მთელი რიცხვი (int)
age = 25
# სიმბოლო, ტექსტი (str)
name = "Snake"
#  (float)
height = 180.5

print(age)
print(name)
print(height)

# 3. კომენტარების გამოყენებით, თქვენი სიტყვებით ახსენით რას ნიშნავს დეკლარაცია , ინიციალიზება  და რეინიციალიზება , ასევე მოიყვანეთ მაგალითები:

# დეკლარაცია — ცვლადის გამოცხადება 
# მაგალითი: age   ← მხოლოდ სახელი, მნიშვნელობა არ აქვს.

# ინიციალიზაცია — ცვლადს პირველად ვანიჭებთ მნიშვნელობას.
age = 18  # აქ age = 18 არის ინიციალიზაცია

# რეინიციალიზაცია — ცვლადს ხელახლა ვანიჭებთ ახალ ან საწყის მნიშვნელობას.
age = None  # რეინიციალიზაცია — წავშალეთ მნიშვნელობა
age = 0     # ან დავაბრუნეთ ნულზე