 # 1. მონაცემების შენახვა და მათი ჩვენება

# ჩემი სახელი , ასაკი , სიმაღლე , წონა

name = "Snake"
age = 25
height = 180 
weight = 75  

print(name)
print(age)
print(height)
print(weight)

# 2. მონაცემთა ტიპები და მაგალითები

# მთელი რიცხვი (int)
age = 25
# სიმბოლო, ტექსტი (str)
name = "Snake"
# სემიანი რიცხვი (float)
height = 180.5

print(age)
print(name)
print(height)

# 3. დეკლარაცია, ინიციალიზაცია და რეინიციალიზება
 # დეკლარაცია — როდესაც ადასტურებ, რომ გინდა შექმნა ცვლადი და ვაჩენ მას სახელით, მაგრამ მნიშვნელობა ჯერ არა აქვს.
 # იუმინალიზაცია — როდესაც ცვლადს ვანიჭებ მნიშვნელობას პირველად.
# რეინიციალიზება — როდესაც ცვლადს ვანიჭებ ახალი მნიშვნელობას, რომელიც სხვაა პირვანდელი.

# მაგალითები :


# დეკლარაცია 
total_score = None 

# ინიციალიზაცია (პირველად ვანიჭებთ მნიშვნელობას)
total_score = 85

# რეინიციალიზება (მეორედ, ვანიჭებთ ახალ მნიშვნელობას)
total_score = 92

